In [17]:
import pandas as pd 
df = pd.DataFrame({
    'Columna1': ['F', 'A', 'F'],
    'Columna2': [100, 200, 50]
})
df3 = df.query("Columna1 == 'F'")
#df3
df4 = df.query("Columna2 >= 100")
df4

  Columna1  Columna2
0        F       100
1        A       200

In [5]:
def normalizador(numero):
    numero = str(numero)
    if ',' in numero or '.' in numero or '$' in numero:
        numero = numero.replace('$', '')
        numero = numero.replace(',', '')
        numero = numero.split('.')[0]
        return int(numero)
    else:
        try:
            return int(numero)
        except:
            return 0

normalizador('$.6600')

ValueError: invalid literal for int() with base 10: ''

In [28]:
x = '8843800075.0'
print(int(x))

ValueError: invalid literal for int() with base 10: '8843800075.0'

In [26]:
import re
patron = '[0-9]+'
def normalizador(numero):
    numero = str(numero)
    if len(numero) > 0: 
        valido = re.findall(patron, numero)
        if len(valido) > 0:
            return(int(valido[0]))
        else:
            return 0
    else:
        return 0
    #print(valido)
    # if ',' in numero or '.' in numero or '$' in numero:
    #     numero = numero.replace('$', '')
    #     numero = numero.replace(',', '')
    #     numero = numero.split('.')[0]
    #     return int(numero)
    # else:
    #     try:
    #         return int(numero)
    #     except:
    #         return 0

normalizador('100524.78')
#100.524,78

100524

In [2]:
x = '$10,000.00'
if ',' in x and '.' in x:
    x = x.replace('$', '')
    x = x.replace(',', '')
    x = x[:-3]
print(x)

10000

In [2]:
x = '25879.0'
print(x.split('.')[0])

25879

In [7]:
import re
y = '20290779CD3'
patron = '[0-9]+'
valido = re.findall(patron, y)
print(''.join(valido))

202907793

In [1]:
lista = [1,2,3]
if 2 in lista:
    print('está el 2')

está el 2

In [7]:
import re
i='1132C3759.0'
patron = '[0-9]+'
i = str(i)
valido = re.findall(patron, i)
print(valido)
valido = [i for i in valido if i != '0']
print(valido)
print(int(''.join(valido)))

['1132', '3759', '0']
['1132', '3759']
11323759

In [4]:
import pandas as pd 
df1 = pd.DataFrame({ 'Col1': [1,2,3] })
df2 = pd.DataFrame({ 'Col1': [3,4,5]})
display(df1)
display(df2)
df3 = df1.merge(df2, how='inner', on='Col1')
display(df3)

   Col1
0     1
1     2
2     3

   Col1
0     3
1     4
2     5

   Col1
0     3

In [2]:
import os 
lista_unificados = os.listdir(f'M:/PAGOS/__Pagos/Pagos_Test/Pagos_Test/bin/Temp/MejorCredito/Sucursal')
lista_unificados = [i.lower() for i in lista_unificados]
print(lista_unificados)
cierre = [i for i in lista_unificados if 'unificado' in i]
print(cierre[0])

['cierre noviembre 2022.xlsx', 'unificado de pagos noviembre.xlsx']
unificado de pagos noviembre.xlsx

In [6]:
for i in lista_unificados:
    if 'cierre' in i:
        print('Hay un cierre')

Hay un cierre

In [7]:
if 'cierre' in lista_unificados:
    print('Hay un cierre')

In [3]:
import pandas as pd 
df = pd.DataFrame({'DNI': [33273611, 33273611], 'IMPORTE': [21580, 20000]})
print(df)

        DNI  IMPORTE
0  33273611    21580
1  33273611    20000

In [8]:
#Tengo que crear una nueva columna con la cantidad de veces que se repite
contador = 0
def conteo(i):
    global contador 
    if contador == 0:
        base = df.iloc[contador][0]
        print(base)
        return contador
    else:
        return 'Otro num'
    contador += 1
    
df['CONTEO'] = df['DNI'].apply(conteo)
df

33273611
33273611

        DNI  IMPORTE  CONTEO
0  33273611    21580       0
1  33273611    20000       0

In [88]:
import pandas as pd 
df1 = pd.DataFrame({
    'DNI': [33273611, 33273611],
    'STATUS': ['Válido', 'Válido'],
    'DF': [1, 1]
})
#df1 = df1[['DNI']]
display(df1)
df2 = pd.DataFrame({
    'DNI': [33273611, 33273611, 33273611, 1, 1],
    'MONTO': [21580, 20000, 20000, 10, 10],
    'DF': [2, 2, 2, 2, 2]
})
#df2 = df2[['DNI', 'MONTO']]
display(df2)

        DNI  STATUS  DF
0  33273611  Válido   1
1  33273611  Válido   1

        DNI  MONTO  DF
0  33273611  21580   2
1  33273611  20000   2
2  33273611  20000   2
3         1     10   2
4         1     10   2

In [89]:
lista_validos = list(df1['DNI'])
print(lista_validos)

[33273611, 33273611]

In [90]:
#Comparo df2 con la lista de dni de df1. Si está en la lista, entonces el registro
#se agrega a un nuevo dataframe
df_nuevo = pd.DataFrame({
    'DNI': [],
    'MONTO': []
})
for i in range(len(df2)):
    if df2.iloc[i]['DNI'] in lista_validos:
        registro = pd.DataFrame({
            'DNI': [df2.iloc[i]['DNI']],
            'MONTO': [df2.iloc[i]['MONTO']],
            })
        df_nuevo = pd.concat([df_nuevo, registro])
        #Elimino el dni de la lista
        lista_validos.remove(df2.iloc[i]['DNI'])
df_nuevo = df_nuevo.astype(int)
df_nuevo

        DNI  MONTO
0  33273611  21580
0  33273611  20000

In [57]:
# def funcion(x, y):
#     if x in lista_validos:
#         return y
# #df1['NUEVA'] = df2.apply(lambda x: df2(x.DNI, x.MONTO), axis=1)
# df2['NUEVA'] = df2.apply(lambda x: df2(x.DNI, x.MONTO), axis=1)

In [37]:
#df_merge = df1.merge(df2, on='DNI', how='left')
#df_merge

In [38]:
df_concat = pd.concat([df1, df2])
df_concat

        DNI  STATUS  DF    MONTO
0  33273611  Válido   1      NaN
1  33273611  Válido   1      NaN
0  33273611     NaN   2  21580.0
1  33273611     NaN   2  20000.0
2  33273611     NaN   2  20000.0
3         1     NaN   2     10.0
4         1     NaN   2     10.0

In [ ]:
#Comparación entre dfs

In [39]:
df_concat.dropna(subset=['MONTO'], inplace=True)
#df_concat['STATUS'] = 'Válido'
df_concat

        DNI  STATUS  DF    MONTO
0  33273611  Válido   2  21580.0
1  33273611  Válido   2  20000.0
2  33273611  Válido   2  20000.0
3         1  Válido   2     10.0
4         1  Válido   2     10.0

In [32]:
import pandas as pd 
df_unificado = pd.read_excel(f'M:/PAGOS/__Pagos/Pagos_Test/Pagos_Test/bin/Temp/MejorCredito/Sucursal/UNIFICADO DE PAGOS NOVIEMBRE.xlsx', usecols=['DNI', 'IMPORTE'])

In [28]:
df_unificado.head()

        DNI  IMPORTE
0  17340736  15645.0
1  32055633   5400.0
2   6416621  14260.0
3  20041726  11170.0
4  18220228   7500.0

In [33]:
df = pd.DataFrame({
    'DNI': [17766443, 28759437, 29754764, 29236621, 43414596,
    41146270, 24109496, 16802248, 22966060, 43414596]
})
lista_dnis = list(df['DNI'])
print(lista_dnis)

[17766443, 28759437, 29754764, 29236621, 43414596, 41146270, 24109496, 16802248, 22966060, 43414596]

In [34]:
import numpy as np 
df_nuevo = pd.DataFrame({
    'DNI': [],
    'IMPORTE': []
})
df_negativo = pd.DataFrame({})
for i in range(len(df_unificado)):
    if df_unificado.iloc[i]['DNI'] in lista_dnis:
        registro = pd.DataFrame({
            'DNI': [df_unificado.iloc[i]['DNI']],
            'STATUS': ['Válido por Unificado'],
            'IMPORTE': [df_unificado.iloc[i]['IMPORTE']],
            'Operador': ['Melanie Gonzalez']
            })
        df_nuevo = pd.concat([df_nuevo, registro])
        #Elimino el dni de la lista
        lista_dnis.remove(df_unificado.iloc[i]['DNI'])
    # else:
    #     registro = pd.DataFrame({
    #         'DNI': [df_unificado.iloc[i]['DNI']],
    #         'STATUS': ['Falta Comprobante'],
    #         'IMPORTE': [np.nan],
    #         'Operador': ['Melanie Gonzalez']
    #     })
    #     df_negativo = pd.concat([df_negativo, registro])
#df_nuevo = df_nuevo.astype(int)
display(df_nuevo)
df_resto = pd.DataFrame({
    'DNI': lista_dnis
})
#display(df_resto)

df_resto['IMPORTE'] = np.nan
df_resto['STATUS'] = 'Falta Comprobante'
df_resto['Operador'] = 'Melanie Gonzalez'
display(df_resto)

          DNI  IMPORTE                STATUS          Operador
0  17766443.0  15359.0  Válido por Unificado  Melanie Gonzalez
0  29236621.0  20000.0  Válido por Unificado  Melanie Gonzalez
0  41146270.0  11000.0  Válido por Unificado  Melanie Gonzalez
0  24109496.0  20000.0  Válido por Unificado  Melanie Gonzalez

        DNI  IMPORTE             STATUS          Operador
0  28759437      NaN  Falta Comprobante  Melanie Gonzalez
1  29754764      NaN  Falta Comprobante  Melanie Gonzalez
2  43414596      NaN  Falta Comprobante  Melanie Gonzalez
3  16802248      NaN  Falta Comprobante  Melanie Gonzalez
4  22966060      NaN  Falta Comprobante  Melanie Gonzalez
5  43414596      NaN  Falta Comprobante  Melanie Gonzalez

In [16]:
df_negativo

           DNI             STATUS  IMPORTE          Operador
0   17340736.0  Falta Comprobante      NaN  Melanie Gonzalez
0   32055633.0  Falta Comprobante      NaN  Melanie Gonzalez
0    6416621.0  Falta Comprobante      NaN  Melanie Gonzalez
0   20041726.0  Falta Comprobante      NaN  Melanie Gonzalez
0   18220228.0  Falta Comprobante      NaN  Melanie Gonzalez
..         ...                ...      ...               ...
0   28391223.0  Falta Comprobante      NaN  Melanie Gonzalez
0   24539735.0  Falta Comprobante      NaN  Melanie Gonzalez
0   35180608.0  Falta Comprobante      NaN  Melanie Gonzalez
0   41176131.0  Falta Comprobante      NaN  Melanie Gonzalez
0   14905267.0  Falta Comprobante      NaN  Melanie Gonzalez

[1055 rows x 4 columns]

In [9]:
df_nuevo['STATUS'] = 'Válido por Unificado'
df_nuevo['Operador'] = 'Melanie Gonzalez'
df_nuevo

        DNI  IMPORTE                STATUS          Operador
0  17766443    15359  Válido por Unificado  Melanie Gonzalez
0  29236621    20000  Válido por Unificado  Melanie Gonzalez
0  41146270    11000  Válido por Unificado  Melanie Gonzalez
0  24109496    20000  Válido por Unificado  Melanie Gonzalez

In [1]:
x = 10 
if 'x' in locals():
    print('x existe')
else:
    print('x no existe')

x existe

In [25]:
import pandas as pd 
import numpy as np
df1 = pd.DataFrame({
    'DNI': [28759437, 
            28759437,
            29754764, 
            43414596, 
            51808640387],
    'STATUS': ['Falta Comprobante',
               'Falta Comprobante',
               'Falta Comprobante',
               'Falta Comprobante',
               'Falta Excel'],
    'IMPORTE': [np.nan, np.nan, np.nan, np.nan, np.nan],
    'Operador': ['Melanie Gonzalez',
                 'Melanie Gonzalez',
                 'Melanie Gonzalez',
                 'Melanie Gonzalez',
                 'Melanie Gonzalez']
})
display(df1)
df2 = pd.DataFrame({
    'DNI': [28759437, 28759437, 28759437, 29754764, 43414596, 51808640387],
    'STATUS': ['-', 
               '-',
               '-',
               '-',
               '-',
               '-']
})
display(df2)

           DNI             STATUS  IMPORTE          Operador
0     28759437  Falta Comprobante      NaN  Melanie Gonzalez
1     28759437  Falta Comprobante      NaN  Melanie Gonzalez
2     29754764  Falta Comprobante      NaN  Melanie Gonzalez
3     43414596  Falta Comprobante      NaN  Melanie Gonzalez
4  51808640387        Falta Excel      NaN  Melanie Gonzalez

           DNI STATUS
0     28759437      -
1     28759437      -
2     28759437      -
3     29754764      -
4     43414596      -
5  51808640387      -

In [26]:
df1.drop_duplicates(inplace=True)
df1

           DNI             STATUS  IMPORTE          Operador
0     28759437  Falta Comprobante      NaN  Melanie Gonzalez
2     29754764  Falta Comprobante      NaN  Melanie Gonzalez
3     43414596  Falta Comprobante      NaN  Melanie Gonzalez
4  51808640387        Falta Excel      NaN  Melanie Gonzalez

In [27]:
df2.drop('STATUS', axis=1, inplace=True)

In [28]:
df_merge = df1.merge(df2, on='DNI', how='inner')
df_merge

#Eliminar duplicados

           DNI             STATUS  IMPORTE          Operador
0     28759437  Falta Comprobante      NaN  Melanie Gonzalez
1     28759437  Falta Comprobante      NaN  Melanie Gonzalez
2     28759437  Falta Comprobante      NaN  Melanie Gonzalez
3     29754764  Falta Comprobante      NaN  Melanie Gonzalez
4     43414596  Falta Comprobante      NaN  Melanie Gonzalez
5  51808640387        Falta Excel      NaN  Melanie Gonzalez

---

In [15]:
lista_unificados = os.listdir(f'M:/PAGOS/__Pagos/Pagos_Test/Pagos_Test/bin/Temp/MejorCredito/Sucursal')
lista_unificados = [i.lower() for i in lista_unificados] #Todo a minúsculas

#--------------- Archivos ---------------#
unificado = [i for i in lista_unificados if 'unificado' in i]
if len(unificado) > 0:
    unificado = unificado[0]
else:
    unificado = ''

cierre = [i for i in lista_unificados if 'cierre' in i]
if len(cierre) > 0:
    cierre = cierre[0]
else:
    cierre = ''

In [16]:
unificado

'unificado de pagos noviembre.xlsx'

In [17]:
cierre

'cierre noviembre 2022.xlsx'

---

2da etapa - Choque con Distribución.  
Cierre - Todos menos los válidos

In [220]:
import pandas as pd 
df_cierre1 = pd.read_excel(f'M:/PAGOS/__Pagos/Pagos_Test/Pagos_Test/bin/Temp/MejorCredito/Sucursal/CIERRE NOVIEMBRE 2022.xlsx', sheet_name='COBRANZA MEJOR CREDITO', usecols=['doc.', 'fecha', 'est'])
df_cierre2 = pd.read_excel(f'M:/PAGOS/__Pagos/Pagos_Test/Pagos_Test/bin/Temp/MejorCredito/Sucursal/CIERRE NOVIEMBRE 2022.xlsx', sheet_name='RENDICION MAS COBRANZAS', usecols=['DNI', 'Fecha de Pago', ' Importe Total '])
df_cierre1 = df_cierre1.iloc[:-1] #Elimino el total calculado a mano
df_cierre2 = df_cierre2.iloc[:-1] #Elimino el total calculado a mano

df_cierre1.rename({'doc.': 'DNI', 'est': 'IMPORTE', 'fecha': 'Fecha de Pago'}, axis=1, inplace=True)
df_cierre2.rename({' Importe Total ': 'IMPORTE'}, axis=1, inplace=True)
df_cierre1['DF'] = 1 #Distinguir de dónde viene
df_cierre2['DF'] = 2 #Distinguir de dónde viene

df_cierre = pd.concat([df_cierre1, df_cierre2]) #Concateno en un único df 
df_cierre['DNI'] = df_cierre['DNI'].apply(int)

In [221]:
display(df_cierre.head(2))
print(df_cierre.shape)

  Fecha de Pago       DNI  IMPORTE  DF
0    2022-11-01  32055633   5400.0   1
1    2022-11-01   6416621  14260.0   1

(1145, 4)

Por operador:
Quito del cierre los válidos

In [222]:
df_cierre[df_cierre['DNI'] == 96033138]

    Fecha de Pago       DNI  IMPORTE  DF
428    2022-11-10  96033138   3000.0   1
474    2022-11-11  96033138   3000.0   1
642    2022-11-16  96033138  12010.0   1

In [224]:
#Cargo los válidos de todos los operadores
df_validos_gral = pd.read_excel('M:/PAGOS/__Pagos/Pagos_Test/Pagos_Test/bin/Scripts/Py/df_validos_gral.xlsx')
display(df_validos_gral.head(2))
print(df_validos_gral.shape)

        DNI             STATUS  IMPORTE        Operador
0  16308470  Válido por Cierre  50000.0  Ariana Messina
1  43287995  Válido por Cierre   3540.0  Ariana Messina

(764, 4)

In [225]:
lista_dnis = list(df_validos_gral['DNI'])
df_nuevo = pd.DataFrame({})
#Quiero los cierres quitando los válidos
for index_dfc in range(len(df_cierre)):
    if df_cierre.iloc[index_dfc]['DNI'] not in lista_dnis:
        registro = pd.DataFrame({
            'DNI': [df_cierre.iloc[index_dfc]['DNI']],
            'IMPORTE': [df_cierre.iloc[index_dfc]['IMPORTE']],
            # 'SALDO': [df_cierre.iloc[index_dfc]['SALDO']],
            # 'Operador': 'Melanie Gonzalez'
            })
        df_nuevo = pd.concat([df_nuevo, registro])
        #Elimino el dni de la lista
        #lista_dnis.remove(df.iloc[index_dfc]['DNI'])
df_resto = pd.DataFrame({'DNI': lista_dnis})
#df_nuevo son los registros del cierre que no son válidos
print(df_nuevo.shape)
#df_nuevo.to_excel('M:/PAGOS/__Pagos/Pagos_Test/Pagos_Test/bin/Temp/MejorCredito/Resultados/df_cierre_no_validos.xlsx', index=False)

(362, 2)

In [226]:
df_nuevo[df_nuevo['DNI'] == 96033138]

        DNI  IMPORTE
0  96033138   3000.0
0  96033138   3000.0
0  96033138  12010.0

Choque contra distribución:

In [227]:
import pandas as pd
df = pd.read_excel('M:/FEDERICO/DISTRIBUCION MEJOR CREDITO 0112.xlsx',
usecols=['DNI', 'OPERADOR'])
display(df.head(2))
print(df.shape)

        DNI OPERADOR
0  33854915   MARINA
1  32758624   MARINA

(32244, 2)

In [228]:
df[df['DNI'] == 96033138]

           DNI           OPERADOR
6734  96033138  IAMBERTI JOSEFINA

In [229]:
df['OPERADOR'].value_counts()

MARINA                 22524
CONSTANZA LOPEZ          981
REDONDO AYLEN            968
SOTELO TATIANA           673
GIMENEZ LUCIANA          670
PAULALEAL                669
FANTIN MALENA            668
MELANIE GONZALEZ         664
TERCEROS CAMILA          661
MESSINA ARIANA           660
SAENZ FLORENCIA          653
LOCANE ESTEFANIA         653
BAEZ DAIANA              651
DALOISIO LUCIA           383
IAMBERTI JOSEFINA        383
LEGUIZAMON GIULIANA      383
Name: OPERADOR, dtype: int64

In [230]:
#Quito los no gestionables de la distribución
df2 = df[df['OPERADOR'] != 'MARINA']
print(df2.shape)

(9720, 2)

In [231]:
#Choque del cierre quitando los Válidos y la distribución
#Los registros del cierre que están en la distribución
df_merge = df_nuevo.merge(df2, on='DNI', how='inner')
#df_sin_gestion:
df_merge

          DNI  IMPORTE             OPERADOR
0    11861822  15000.0  LEGUIZAMON GIULIANA
1    41130963  33425.0  LEGUIZAMON GIULIANA
2    36442831   2000.0       DALOISIO LUCIA
3    31653501  24000.0       DALOISIO LUCIA
4    29343327  11192.0    IAMBERTI JOSEFINA
..        ...      ...                  ...
266  12530496   7500.0       DALOISIO LUCIA
267  12399793   5810.0    IAMBERTI JOSEFINA
268  31550078   7380.0       DALOISIO LUCIA
269  27626346  28200.0  LEGUIZAMON GIULIANA
270  24339111  10000.0    IAMBERTI JOSEFINA

[271 rows x 3 columns]

In [232]:
df_merge = df_nuevo.merge(df2, on='DNI', how='inner')
#df_sin_gestion:
df_merge

          DNI  IMPORTE             OPERADOR
0    11861822  15000.0  LEGUIZAMON GIULIANA
1    41130963  33425.0  LEGUIZAMON GIULIANA
2    36442831   2000.0       DALOISIO LUCIA
3    31653501  24000.0       DALOISIO LUCIA
4    29343327  11192.0    IAMBERTI JOSEFINA
..        ...      ...                  ...
266  12530496   7500.0       DALOISIO LUCIA
267  12399793   5810.0    IAMBERTI JOSEFINA
268  31550078   7380.0       DALOISIO LUCIA
269  27626346  28200.0  LEGUIZAMON GIULIANA
270  24339111  10000.0    IAMBERTI JOSEFINA

[271 rows x 3 columns]

In [217]:
df_merge[df_merge['DNI'] == 96033138]

         DNI  IMPORTE           OPERADOR
66  96033138   3000.0  IAMBERTI JOSEFINA
67  96033138   3000.0  IAMBERTI JOSEFINA
68  96033138  12010.0  IAMBERTI JOSEFINA

In [234]:
#df_sin_gestion debe tener las columnas:
#DNI - IMPORTE - Asignado - Gestionado
df_merge.rename({'OPERADOR': 'ASIGNADO'}, axis=1, inplace=True)
#df_merge['GESTIONADO'] = 'Op'
df_merge.to_excel('M:/PAGOS/__Pagos/Pagos_Test/Pagos_Test/bin/Temp/MejorCredito/Resultados/df_sin_gestion.xlsx', index=False)

In [235]:
#Busco los registros del cierre que NO están en la distribución
lista_dnis = list(df['DNI']) #dnis de la distribución
df_nuevo2 = pd.DataFrame({})
for index_dfc in range(len(df_nuevo)):
    if df_nuevo.iloc[index_dfc]['DNI'] not in lista_dnis:
        registro = pd.DataFrame({
            'DNI': [df_nuevo.iloc[index_dfc]['DNI']],
            'IMPORTE': [df_nuevo.iloc[index_dfc]['IMPORTE']],
            #'SALDO': [df_nuevo.iloc[index_dfc]['SALDO']],
            #'Operador': 'Melanie Gonzalez'
            })
        df_nuevo2 = pd.concat([df_nuevo2, registro])
        #Elimino el dni de la lista
        #lista_dnis.remove(df.iloc[index_dfc]['DNI'])
#df_resto = pd.DataFrame({'DNI': lista_dnis})
#df_nuevo son los registros del cierre que no son válidos
print(df_nuevo2.shape)
df_nuevo2.to_excel('M:/PAGOS/__Pagos/Pagos_Test/Pagos_Test/bin/Temp/MejorCredito/Resultados/df_dni_no_distribuido.xlsx', index=False)

(80, 2)

In [1]:
import pandas as pd 
df = pd.DataFrame({'Col1': [1,2,3,4,5]})
df

   Col1
0     1
1     2
2     3
3     4
4     5

In [5]:
df2 = df[df['Col1'] >= 3]
df2

   Col1
2     3
3     4
4     5

In [4]:
df2 = df.query("Col1 >= 3")
df2

   Col1
2     3
3     4
4     5

Escribir una función que convierta un número decimal en binario y otra que convierta un número binario en decimal.

In [12]:
num = '101011'
def aBinario(num):
    binario = bin(num)
    return int(binario[2:])

def aDecimal(num):
    decimal = int(num, 2)
    return decimal

aDecimal(num)

43

In [1]:
num_binario = '11101'
a_decimal = int(num_binario, 2)
print(a_decimal)

29

In [3]:
decimal = 29
a_binario = bin(decimal)
print(a_binario[2:])

11101